Examinator/src/InformationRegisters/НастройкиТемФорумаСУО/НастройкиТемФорумаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиТемФорумаСУО</name>
  <attributes>
    <name>РазделФорума</name>
    <type>
      <types>CatalogRef.РазделыФорумаСУО</types>
      <types>CatalogRef.УчебныеГруппыСУО</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>CatalogRef.УчебныеГруппыОО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПросмотра</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Помечена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/НастройкиТемОбщенияСУО/НастройкиТемОбщенияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиТемОбщенияСУО</name>
  <attributes>
    <name>ДатаПросмотра</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Архивирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Помечена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/СообщенияТемСУО/СообщенияТемСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СообщенияТемСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>РазделФорума</name>
    <type>
      <types>CatalogRef.РазделыФорумаСУО</types>
      <types>CatalogRef.УчебныеГруппыСУО</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>CatalogRef.УчебныеГруппыОО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеСообщение</name>
    <type>
      <types>DocumentRef.СообщениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
    </type>
  </attributes>
  <dimensions>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/АвтоРазделыФорумаСУО/АвтоРазделыФорумаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АвтоРазделыФорумаСУО</name>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Раздел</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>CatalogRef.УчебныеГруппыОО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Documents/СообщениеСУО/СообщениеСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СообщениеСУО</name>
  <basedOn>Catalog.ШаблоныСообщенийСУО</basedOn>
  <registerRecords>InformationRegister.ТемыПользователейСУО</registerRecords>
  <registerRecords>InformationRegister.СообщенияТемСУО</registerRecords>
  <registerRecords>InformationRegister.ТемыМодераторовСУО</registerRecords>
  <registerRecords>InformationRegister.ЛичныеСообщенияПользователейСУО</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяТекстовыйДокумент</name>
    <comment>Введено для сохранения оригинала сообщения из веб-кабинета</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовыйДокумент</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервоеСообщениеВТеме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>DocumentRef.НовостьСУО</types>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассылка</name>
    <type>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоЭлектроннаяПочта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеСообщение</name>
    <type>
      <types>DocumentRef.СообщениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленоМодератором</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУдаленияМодератором</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалившийМодератор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗначенияПеременных</name>
    <attributes>
      <name>Переменная</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеАдреса</name>
    <attributes>
      <name>АдресЭлектроннойПочты</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Catalogs/РазделыФорумаСУО/РазделыФорумаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РазделыФорумаСУО</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляВсех</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Видимость</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Модератор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/ТемыСообщенийСУО/ТемыСообщенийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТемыСообщенийСУО</name>
  <attributes>
    <name>Кому</name>
    <type>
      <types>EnumRef.АдресатыСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Контекст</name>
    <type>
      <types>CatalogRef.РазделыФорумаСУО</types>
      <types>CatalogRef.ОрганизаторыСУО</types>
      <types>CatalogRef.УчебныеГруппыСУО</types>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПроведениеПреподавателемОбученияСУО</types>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>CatalogRef.УчебныеГруппыОО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассылка</name>
    <type>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеПолучатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсключенныеПолучатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/CommonForms/ФорумСУО/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ПометитьТемуНаСервере(Тема)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	РегистрыСведений.НастройкиТемФорумаСУО.ЗаписатьНастройки(Тема, "Помечена");
	РегистрыСведений.НастройкиТемОбщенияСУО.ЗаписатьНастройки(Тема, "Помечена", Истина);
	
	ЗафиксироватьТранзакцию();
	
	Элементы.ТемыФорума.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ПереместитьТемуНаСервере(Тема, НовыйРаздел)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	// Записываем новый раздел
	
	ТемаОбъект = Тема.ПолучитьОбъект();
	ТемаОбъект.Контекст = НовыйРаздел;
	ТемаОбъект.Записать();
	
	// Перепроводим сообщения
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СообщениеСУО.Ссылка
		|ИЗ
		|	Документ.СообщениеСУО КАК СообщениеСУО
		|ГДЕ
		|	СообщениеСУО.Проведен = ИСТИНА
		|	И СообщениеСУО.Тема = &Тема";

	Запрос.УстановитьПараметр("Тема", Тема);

	Результат = Запрос.Выполнить();

	МассивДокументов = Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");

	МассивНепроведенныхДокументов = ОбщегоНазначения.ПровестиДокументы(МассивДокументов);
	
	// Меняем настройки

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиТемФорумаСУО.Пользователь,
		|	НастройкиТемФорумаСУО.РазделФорума,
		|	НастройкиТемФорумаСУО.ДатаПросмотра,
		|	НастройкиТемФорумаСУО.Помечена,
		|	НастройкиТемФорумаСУО.Тема
		|ИЗ
		|	РегистрСведений.НастройкиТемФорумаСУО КАК НастройкиТемФорумаСУО
		|ГДЕ
		|	НастройкиТемФорумаСУО.Тема = &Тема";

	Запрос.УстановитьПараметр("Тема", Тема);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		НаборЗаписей = РегистрыСведений.НастройкиТемФорумаСУО.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Тема.Установить(ВыборкаДетальныеЗаписи.Тема);
		НаборЗаписей.Отбор.Пользователь.Установить(ВыборкаДетальныеЗаписи.Пользователь);

		НаборЗаписей.Прочитать();
		
		Запись = НаборЗаписей[0];
			
		Запись.РазделФорума = НовыйРаздел;
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	Элементы.ТемыФорума.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборы()
	
	Если ОтображаемыеТемы = "Все" Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(ТемыФорума.Отбор, "ЕстьНовыеСообщения");	
	КонецЕсли;
	
	Если ОтображаемыеТемы = "Непрочтенные" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ТемыФорума.Отбор, "ЕстьНовыеСообщения", Истина);
	КонецЕсли;
	
	Если ОтображаемыеТемы = "Прочтенные" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ТемыФорума.Отбор, "ЕстьНовыеСообщения", Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	УстановитьОтборы();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоТемСНовымиСообщениями(РазделФорума, ТаблицаДанныхТем)
	
	КоличествоТемСНовымиСообщениями = 0;
	
	НайденныеТемыРаздела = ТаблицаДанныхТем.НайтиСтроки(Новый Структура("РазделФорума", РазделФорума));
	
	Для каждого СтрокаТДТ Из НайденныеТемыРаздела Цикл
	
		Если ЗначениеЗаполнено(СтрокаТДТ.ДатаПросмотра)
			И ЗначениеЗаполнено(СтрокаТДТ.ДатаПоследнегоСообщения)
			И СтрокаТДТ.ДатаПросмотра < СтрокаТДТ.ДатаПоследнегоСообщения Тогда
			
			КоличествоТемСНовымиСообщениями = КоличествоТемСНовымиСообщениями + 1;
			
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат КоличествоТемСНовымиСообщениями;
	
КонецФункции

&НаСервере
Функция ПолучитьТаблицуТемРазделов()
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Выбираем настройки всех тем

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиТемФорумаСУО.ДатаПросмотра,
		|	НастройкиТемФорумаСУО.РазделФорума,
		|	СообщенияТемСУОСрезПоследних.Период КАК ДатаПоследнегоСообщения,
		|	НастройкиТемФорумаСУО.Тема
		|ИЗ
		|	РегистрСведений.НастройкиТемФорумаСУО КАК НастройкиТемФорумаСУО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СообщенияТемСУО.СрезПоследних КАК СообщенияТемСУОСрезПоследних
		|		ПО НастройкиТемФорумаСУО.Тема = СообщенияТемСУОСрезПоследних.Тема
		|ГДЕ
		|	НастройкиТемФорумаСУО.Пользователь = &ТекущийПользователь
		|	И СообщенияТемСУОСрезПоследних.Период > НастройкиТемФорумаСУО.ДатаПросмотра";

	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());

	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();
	
КонецФункции

&НаСервере
Процедура СформироватьДеревоФорума() 

	// Разделы форума
	//
	
	ТаблицаТемРазделов = ПолучитьТаблицуТемРазделов();

	// Выбираем общие разделы

	ДеревоОбщихРазделов = Справочники.РазделыФорумаСУО.РазделыПользователя();

	// Выбираем пользовательские разделы

	ТаблицаПользовательскихРазделов = РегистрыСведений.АвтоРазделыФорумаСУО.РазделыПользователя(Пользователи.ТекущийПользователь());
	
	ТаблицаТиповПользовательскихРазделов = ТаблицаПользовательскихРазделов.Скопировать();
	
	ТаблицаТиповПользовательскихРазделов.Свернуть("ТипРаздела");

	МассивТиповПользовательскихРазделов = ТаблицаТиповПользовательскихРазделов.ВыгрузитьКолонку("ТипРаздела");
	
	ДеревоПользовательскихРазделов	= Новый ДеревоЗначений();
	
	ДеревоПользовательскихРазделов.Колонки.Добавить("Ссылка");
	ДеревоПользовательскихРазделов.Колонки.Добавить("Наименование");
	
	Для каждого ТипПользовательскогоРаздела Из МассивТиповПользовательскихРазделов Цикл
	
		НоваяСтрокаДПР = ДеревоПользовательскихРазделов.Строки.Добавить(); 
	    НоваяСтрокаДПР.Ссылка = Неопределено;
		НоваяСтрокаДПР.Наименование = Строка(ТипПользовательскогоРаздела);
		
		РазделыТекущегоТипа =  ТаблицаПользовательскихРазделов.НайтиСтроки(Новый Структура("ТипРаздела", ТипПользовательскогоРаздела));
		
		Для каждого СтрокаРТТ Из РазделыТекущегоТипа Цикл
		
			НоваяСтрокаДПР2 = НоваяСтрокаДПР.Строки.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрокаДПР2, СтрокаРТТ);
			
		КонецЦикла;
		
	КонецЦикла;
	
    // Формируем дерево
	
	ДеревоРазделов = Новый ДеревоЗначений();
	ДеревоРазделов.Колонки.Добавить("Ссылка");
	ДеревоРазделов.Колонки.Добавить("Наименование");
	ДеревоРазделов.Колонки.Добавить("Картинка");
	ДеревоРазделов.Колонки.Добавить("КоличествоТемСНовымиСообщениями");
	ДеревоРазделов.Колонки.Добавить("ЕстьПравоСозданияТем");
	
 	ЗаполнитьДеревоФорума(ДеревоРазделов.Строки, ДеревоОбщихРазделов.Строки, ТаблицаТемРазделов, Истина);
	ЗаполнитьДеревоФорума(ДеревоРазделов.Строки, ДеревоПользовательскихРазделов.Строки, ТаблицаТемРазделов, Ложь);
	
	ЗначениеВРеквизитФормы(ДеревоРазделов, "Форум");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоФорума(СтрокиДереваФорума, СтрокиИсточникаДанных, ТаблицаДанныхТем, ЕстьНастройкиВидимости)
	
	Для каждого СтрокаИД Из СтрокиИсточникаДанных Цикл
		
		НоваяСтрокаДФ = СтрокиДереваФорума.Добавить();
		НоваяСтрокаДФ.Ссылка = СтрокаИД.Ссылка;
			
		Если ЗначениеЗаполнено(НоваяСтрокаДФ.Ссылка) Тогда
			НоваяСтрокаДФ.Картинка = 1;
		Иначе
			НоваяСтрокаДФ.Картинка = 2;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаИД.Наименование) Тогда
			НоваяСтрокаДФ.Наименование = СтрокаИД.Наименование;	
		Иначе
			НоваяСтрокаДФ.Наименование = СтрокаИД.Наименование;	
		КонецЕсли;
		
		НоваяСтрокаДФ.КоличествоТемСНовымиСообщениями = ПолучитьКоличествоТемСНовымиСообщениями(СтрокаИД.Ссылка, ТаблицаДанныхТем);
		
		Если ЕстьПравоУправления Тогда
			
			НоваяСтрокаДФ.ЕстьПравоСозданияТем = Истина;
			
		Иначе
			
			Если ЕстьНастройкиВидимости Тогда
				
				НайденныеСтроки = СтрокаИД.Видимость.НайтиСтроки(Новый Структура("Пользователь, Модератор", ТекущийПользователь, Истина));
				
				НоваяСтрокаДФ.ЕстьПравоСозданияТем = ?(НайденныеСтроки.Количество() = 0, Ложь, Истина);
				
			Иначе
				
				НоваяСтрокаДФ.ЕстьПравоСозданияТем = Истина; // Пользовательские авто-разделы (есть право всегда)
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НоваяСтрокаДФ.ЕстьПравоСозданияТем Тогда
			РазрешеноСоздаватьТемы = Истина; // Помечаем, что есть хоты бы один раздел, с правом создания тем
		КонецЕсли;
		
		ЗаполнитьДеревоФорума(НоваяСтрокаДФ.Строки, СтрокаИД.Строки, ТаблицаДанныхТем, ЕстьНастройкиВидимости)	
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция НайтиЭлементДереваФорума(СтрокиДерева=Неопределено, РазделФорума)
	
	Если СтрокиДерева = Неопределено Тогда
		СтрокиДерева = Форум.ПолучитьЭлементы();
	КонецЕсли;
	
	Для каждого ЭлементДерева Из СтрокиДерева Цикл
	
		Если ЭлементДерева.Ссылка = РазделФорума Тогда			
			Возврат ЭлементДерева.ПолучитьИдентификатор();
		КонецЕсли;
		
		ПодчиненныйЭлемент = НайтиЭлементДереваФорума(ЭлементДерева.ПолучитьЭлементы(), РазделФорума);
		
		Если ПодчиненныйЭлемент <> Неопределено Тогда
			Возврат ПодчиненныйЭлемент;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Переменные
	//
	
	ДанныеНастроек = ХранилищеСистемныхНастроек.Загрузить(ЭтотОбъект.ИмяФормы+"/ТекущиеДанные");
	
	Если ДанныеНастроек = Неопределено Тогда
		
		ОтображаемыеТемы = "Все";
		
	Иначе
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеНастроек);
		
	КонецЕсли;
	
	ЕстьПравоУправления = УправлениеДоступом.ЕстьРоль("УправлениеКоммуникациямиСУО");
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	// Разделы форума
	//
	
	СформироватьДеревоФорума();
	
	// Динамические списки
	//
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ТемыФорума.Отбор, "Контекст", Справочники.РазделыФорумаСУО.ПустаяСсылка());
	
	ТемыФорума.Параметры.УстановитьЗначениеПараметра("Пользователь", Пользователи.ТекущийПользователь());
	
	УстановитьОтборы();
	
	// Элементы формы
	//
	
	Элементы.КомандаСоздатьТему.Видимость    = РазрешеноСоздаватьТемы;
	Элементы.ФормаИзменитьТему.Видимость     = ПравоДоступа("Редактирование", Метаданные.Справочники.ТемыСообщенийСУО);
	Элементы.ФормаНастроитьРазделы.Видимость = ЕстьПравоУправления;
	Элементы.ФормаПереместитьТему.Видимость  = ЕстьПравоУправления;
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Параметры.ВыделенныйРаздел) Тогда
		
		ВыделенныйРаздел = НайтиЭлементДереваФорума(, Параметры.ВыделенныйРаздел);
		
		Если ВыделенныйРаздел <> Неопределено Тогда
			Элементы.Форум.ТекущаяСтрока = ВыделенныйРаздел;
		КонецЕсли;		
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписаноСообщениеОбсуждения" Тогда
		Элементы.ТемыФорума.Обновить();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура СоздатьТему(Команда)
	
	ТекущиеДанные = Элементы.Форум.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ПараметрыФормы = Новый Структура("Кому", "НаФоруме");
	Иначе
		ПараметрыФормы = Новый Структура("Контекст", ТекущиеДанные.Ссылка);
	КонецЕсли;
	
	ОткрытьФорму("Документ.СообщениеСУО.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьТему(Команда)
	
	ТекущиеДанные = Элементы.ТемыФорума.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПометитьТемуНаСервере(ТекущиеДанные.Тема);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьТему(Команда)
	
	ТекущиеДанные = Элементы.ТемыФорума.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьТемуПродолжение", ЭтотОбъект);		
	
	ОткрытьФорму("Справочник.ТемыСообщенийСУО.ФормаОбъекта", Новый Структура("Ключ", ТекущиеДанные.Тема),,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьТемуПродолжение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Элементы.ТемыФорума.Обновить();
КонецПроцедуры	

&НаКлиенте
Процедура НастроитьРазделы(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НастроитьРазделыПродолжение", ЭтотОбъект);		
	
	ОткрытьФорму("ОбщаяФорма.НастройкаКоммуникацийСУО", Новый Структура("ОткрытоИзФорума", Истина),,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРазделыПродолжение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	СформироватьДеревоФорума();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	СформироватьДеревоФорума();
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьТему(Команда)
	
	ТекущиеДанные = Элементы.ТемыФорума.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПереместитьТемуПродолжение", ЭтотОбъект, ТекущиеДанные);		
	
	ПоказатьВводЗначения(ОписаниеОповещения, ТекущиеДанные.Контекст, НСтр("ru = 'Выберите раздел форума'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьТемуПродолжение(НовыйРазделТемы, ТекущиеДанные) Экспорт
	
	Если ЗначениеЗаполнено(НовыйРазделТемы)
		И НовыйРазделТемы <> ТекущиеДанные.Контекст Тогда
		
		ПереместитьТемуНаСервере(ТекущиеДанные.Тема, НовыйРазделТемы);
		
	КонецЕсли;
		
КонецПроцедуры	

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ Форум

&НаКлиенте
Процедура ФорумПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Форум.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ТемыФорума.Отбор, "Контекст", ТекущиеДанные.Ссылка);
		Элементы.КомандаСоздатьТему.Доступность = ТекущиеДанные.ЕстьПравоСозданияТем;
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ ТемыФорума

&НаКлиенте
Процедура ТемыФорумаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ТемыФорума.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ОбщениеСУО", Новый Структура("Тема, ЭтоФорум", ТекущиеДанные.Тема, Истина));

КонецПроцедуры

&НаКлиенте
Процедура ОтображаемыеТемыПриИзменении(Элемент)
	УстановитьОтборы();
КонецПроцедуры
